Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/InformationRegisters/ГП_ПараметрыРегламентныхЗаданий/ГП_ПараметрыРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГП_ПараметрыРегламентныхЗаданий</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВыбранныеТипыСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Организации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/InformationRegisters/ГП_ПараметрыРегламентныхЗаданий/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Получает значение параметра из регистра сведений.
//
// Параметры:
//   ИмяПараметра - Строка - имя параметра
//   ЗначениеПоУмолчанию - Произвольный - значение, возвращаемое если параметр не найден
//
// Возвращаемое значение:
//   Произвольный - значение параметра
//
Функция ПолучитьПараметр(ИмяПараметра, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГП_ПараметрыРегламентныхЗаданий.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ГП_ПараметрыРегламентныхЗаданий КАК ГП_ПараметрыРегламентныхЗаданий
	|ГДЕ
	|	ГП_ПараметрыРегламентныхЗаданий.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("Параметр", ИмяПараметра);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

// Устанавливает значение параметра в регистре сведений.
//
// Параметры:
//   ИмяПараметра - Строка - имя параметра
//   Значение - Произвольный - значение параметра для сохранения
//   Документ - ДокументСсылка - необязательный, ссылка на документ, инициировавший изменение
//
Процедура УстановитьПараметр(ИмяПараметра, Значение, Документ = Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Параметр = ИмяПараметра;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Параметр = ИмяПараметра;
	МенеджерЗаписи.Значение = Значение;
	
	Если Документ <> Неопределено Тогда
		МенеджерЗаписи.Документ = Документ;
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Получает все параметры регламентного задания.
//
// Возвращаемое значение:
//   Структура - структура с параметрами:
//     * ВыбранныеТипыСтрокой - Строка
//     * ДатаНачалаПроведения - Дата
//     * КоличествоМесяцевДляПерепроведения - Число
//     * ВыбранныеОрганизации - Массив
//
Функция ПолучитьВсеПараметры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГП_ПараметрыРегламентныхЗаданий.Параметр КАК Параметр,
	|	ГП_ПараметрыРегламентныхЗаданий.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ГП_ПараметрыРегламентныхЗаданий КАК ГП_ПараметрыРегламентныхЗаданий";
	
	Результат = Новый Структура;
	Результат.Вставить("ВыбранныеТипыСтрокой", "");
	Результат.Вставить("ДатаНачалаПроведения", '00010101');
	Результат.Вставить("КоличествоМесяцевДляПерепроведения", 1);
	Результат.Вставить("ВыбранныеОрганизации", "");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Результат.Свойство(Выборка.Параметр) Тогда
			Результат[Выборка.Параметр] = Выборка.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
